-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Янв 23 2023 г., 20:59
-- Версия сервера: 8.0.30
-- Версия PHP: 7.2.34

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `web_store`
--

-- --------------------------------------------------------

--
-- Структура таблицы `cart`
--

CREATE TABLE `cart` (
  `id` int NOT NULL,
  `user_id` int NOT NULL DEFAULT '0',
  `good_id` int NOT NULL,
  `count` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `cart`
--

INSERT INTO `cart` (`id`, `user_id`, `good_id`, `count`) VALUES
(10, 0, 41, 1),
(11, 0, 2, 3),
(12, 0, 11, 1),
(13, 0, 5, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `goods`
--

CREATE TABLE `goods` (
  `good_id` int NOT NULL,
  `title` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `genre` varchar(20) COLLATE utf8mb4_general_ci NOT NULL,
  `info` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `img` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `price` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `goods`
--

INSERT INTO `goods` (`good_id`, `title`, `genre`, `info`, `img`, `price`) VALUES
(1, 'Zebra', 'Абстракция', 'Техника: холст, масло; \r\nГод: 2020; \r\nРазмер: 70х70.', 'abstraction_1_Zebra.jpg', 3000),
(2, 'Абстракция 1', 'Абстракция', 'Техника: холст, масло; \r\nГод: 2022; \r\nРазмер: 70х70.', 'abstraction_2_Абстракция 1.jpg', 4200),
(3, 'Field', 'Абстракция', 'Техника: холст, масло; \r\nГод: 2020; \r\nРазмер: 70х70.', 'abstraction_3_Field.jpg', 2700),
(4, 'Forest lake in the afternoon', 'Абстракция', 'Техника: холст, масло; \r\nГод: 2020; \r\nРазмер: 70х70.', 'abstraction_4_Forest lake in the afternoon.jpg', 3600),
(5, 'Уистлджакет', 'Анимализм', 'Техника: холст, масло; \r\nГод: 2018; \r\nРазмер: 90х70.', 'animals_1_Уистлджакет.jpg', 7000),
(6, 'Слон и собака под зонтом', 'Анимализм', 'Техника: холст, масло; \r\nГод: 2021; \r\nРазмер: 70х90.', 'animals_2_Слон и собака под зонтом.jpg', 4100),
(7, 'Танец котов', 'Анимализм', 'Техника: холст, масло; \r\nГод: 2020; \r\nРазмер: 70х90.', 'animals_3_Танец котов.jpg', 5800),
(8, 'Синяя лошадь', 'Анимализм', 'Техника: холст, масло; \r\nГод: 2017; \r\nРазмер: 70х90.', 'animals_4_Синяя лошадь.jpg', 7400),
(9, 'Портрет льва', 'Анимализм', 'Техника: холст, масло; \r\nГод: 2020; \r\nРазмер: 90х90.', 'animals_5_Портрет льва.jpg', 5000),
(10, 'Moggies', 'Анимализм', 'Техника: холст, масло; \r\nГод: 2016; \r\nРазмер: 70х90.', 'animals_6_Moggies.jpg', 3900),
(11, 'Гранд Бульвар. Париж.', 'Города и страны', 'Техника: холст, масло; \r\nГод: 2020; \r\nРазмер: 70х100.', 'cities_1_Гранд Бульвар. Париж.jpg', 4600),
(12, 'Голландский город', 'Города и страны', 'Техника: холст, масло; \r\nГод: 2020; \r\nРазмер: 90х70.', 'cities_2_Голландский город.jpg', 8900),
(13, 'Вид на озеро Лугано', 'Города и страны', 'Техника: холст, масло; \r\nГод: 2022; \r\nРазмер: 70х90.', 'cities_3_Вид на озеро Лугано.jpg', 6700),
(14, 'Tower Bridge', 'Города и страны', 'Техника: холст, масло; \r\nГод: 2020; \r\nРазмер: 90х70.', 'cities_4_Tower Bridge.jpg', 8000),
(15, 'Исаакиевский собор', 'Города и страны', 'Техника: холст, масло; \r\nГод: 2020; \r\nРазмер: 70х90.', 'cities_5_Исаакиевский собор.jpg', 7900),
(16, 'Казанский собор', 'Города и страны', 'Техника: холст, масло; \r\nГод: 2021; \r\nРазмер: 70х90.', 'cities_6_Казанский собор.jpg', 6100),
(17, 'Рим', 'Города и страны', 'Техника: холст, масло; \r\nГод: 2022; \r\nРазмер: 70х90.', 'cities_7_Рим.jpg', 5000),
(18, 'Колизей', 'Города и страны', 'Техника: холст, масло; \r\nГод: 2021; \r\nРазмер: 110х80.', 'cities_8_Колизей.jpg', 11000),
(19, 'Ирисы', 'Цветы', 'Техника: холст, масло; \r\nГод: 2020; \r\nРазмер: 70х90.', 'flowers_1_Ирисы.jpg', 7300),
(20, 'Горные азалии', 'Цветы', 'Техника: холст, масло; \r\nГод: 2020; \r\nРазмер: 70х90.', 'flowers_2_Горные азалии.jpg', 8000),
(21, 'Красный пион', 'Цветы', 'Техника: холст, масло; \r\nГод: 2022; \r\nРазмер: 80х70.', 'flowers_3_Красный пион.jpg', 3200),
(22, 'Цветущий миндаль', 'Цветы', 'Техника: холст, масло; \r\nГод: 2020; \r\nРазмер: 70х90.', 'flowers_4_Цветущий миндаль.jpg', 7000),
(23, 'Маки на берегу океана', 'Цветы', 'Техника: холст, масло; \r\nГод: 2020; \r\nРазмер: 70х90.', 'flowers_5_Маки на берегу океана.jpg', 6000),
(24, 'Глициния в цвету', 'Цветы', 'Техника: холст, масло; \r\nГод: 2020; \r\nРазмер: 75х95.', 'flowers_6_Глициния в цвету.jpg', 12000),
(25, 'Натюрморт с фруктами', 'Натюрморт', 'Техника: холст, масло; \r\nГод: 2021; \r\nРазмер: 90х70.', 'fruits_1_Натюрморт с фруктами.jpg', 10000),
(26, 'Натюрморт 2', 'Натюрморт', 'Техника: холст, масло; \r\nГод: 2022; \r\nРазмер: 60х50.', 'fruits_2_Натюрморт 2.jpg', 4900),
(27, 'Натюрморт с магнолиями', 'Натюрморт', 'Техника: холст, масло; \r\nГод: 2020; \r\nРазмер: 80х80.', 'fruits_3_Натюрморт с магнолиями.jpg', 11000),
(28, 'Натюрморт на синей ткани', 'Натюрморт', 'Техника: холст, масло; \r\nГод: 2021; \r\nРазмер: 50х70.', 'fruits_4_Натюрморт на синей ткани.jpg', 7400),
(29, 'Натюрморт с яблоками', 'Натюрморт', 'Техника: холст, масло; \r\nГод: 2020; \r\nРазмер: 60х60.', 'fruits_5_Натюрморт с яблоками.jpg', 6000),
(30, 'Лимон и два лайма', 'Натюрморт', 'Техника: холст, масло; \r\nГод: 2022; \r\nРазмер: 65х90.', 'fruits_6_Лимон и два лайма.jpg', 8100),
(31, 'Букет цветов у моря', 'Натюрморт', 'Техника: холст, масло; \r\nГод: 2020; \r\nРазмер: 70х90.', 'fruits_7_Букет цветов на столе у моря.jpg', 5800),
(32, 'Подарки', 'Натюрморт', 'Техника: холст, масло; \r\nГод: 2021; \r\nРазмер: 70х70.', 'fruits_8_Подарки.jpg', 14000),
(33, 'Натюрморт с рыбой', 'Натюрморт', 'Техника: холст, масло; \r\nГод: 2022; \r\nРазмер: 80х60.', 'fruits_9_Натюрморт с рыбой.jpg', 8000),
(34, 'Две рыбацкие лодки', 'Природа', 'Техника: холст, масло; \r\nГод: 2021; \r\nРазмер: 70х90.', 'nature_1_Две рыбацкие лодки.jpg', 5300),
(35, 'Восход солнца', 'Природа', 'Техника: холст, масло; \r\nГод: 2020; \r\nРазмер: 90х120.', 'nature_2_Восход солнца.jpg', 13000),
(36, 'Девятый вал', 'Природа', 'Копия.\r\nТехника: холст, масло; \r\nГод: 2021; \r\nРазмер: 70х100.', 'nature_3_Девятый вал.jpg', 20000),
(37, 'Закат у домика на озере', 'Природа', 'Техника: холст, масло; \r\nГод: 2022; \r\nРазмер: 70х90.', 'nature_4_Закат у домика на озере.jpg', 6000),
(38, 'Вид Пирны', 'Природа', 'Техника: холст, масло; \r\nГод: 2022; \r\nРазмер: 60х90.', 'nature_5_Вид Пирны от замка Зонненштайн.jpg', 8900),
(39, 'Розовый холм', 'Природа', 'Техника: холст, масло; \r\nГод: 2020; \r\nРазмер: 60х45.', 'nature_6_Розовый холм.jpg', 9000),
(40, 'Castlemorton', 'Природа', 'Техника: холст, масло; \r\nГод: 2021; \r\nРазмер: 70х90.', 'nature_7_Castlemorton.jpg', 5000),
(41, 'Вольтерра', 'Природа', 'Техника: холст, масло; \r\nГод: 2021; \r\nРазмер: 70х90.', 'nature_8_Вольтерра.jpg', 8200),
(42, 'Водопад Северный Уэльс', 'Природа', 'Техника: холст, масло; \r\nГод: 2022; \r\nРазмер: 70х90.', 'nature_9_Водопад Северный Уэльс.jpg', 6900),
(43, 'Сверкающий ручей', 'Природа', 'Техника: холст, масло; \r\nГод: 2022; \r\nРазмер: 70х50.', 'nature_10_Сверкающий ручей.jpg', 10000),
(44, 'Палден Лхамо 2', 'Природа', 'Техника: холст, масло; \r\nГод: 2020; \r\nРазмер: 60х90.', 'nature_11_Палден Лхамо 2.jpg', 6100),
(45, 'Зимняя дорога в лес', 'Природа', 'Техника: холст, масло; \r\nГод: 2022; \r\nРазмер: 70х90.', 'nature_12_Зимняя дорога в лес.jpg', 13000),
(46, 'Леди Годива', 'Портрет', 'Техника: холст, масло; \r\nГод: 2021; \r\nРазмер: 70х90.', 'portrait_1_Леди Годива.jpg', 14000),
(47, 'Император Александр II', 'Портрет', 'Техника: холст, масло; \r\nГод: 2021; \r\nРазмер: 90х60.', 'portrait_2_Император Александр II.jpg', 9500),
(48, 'Портрет Петра I', 'Портрет', 'Техника: холст, масло; \r\nГод: 2020; \r\nРазмер: 90х60.', 'portrait_3_Портрет Петра I.jpg', 4200),
(49, 'Портрет Шаляпина', 'Портрет', 'Техника: холст, масло; \r\nГод: 2020; \r\nРазмер: 70х60.', 'portrait_4_Портрет Шаляпина.jpg', 6300),
(50, 'Портрет И.С.Тургенева', 'Портрет', 'Техника: холст, масло; \r\nГод: 2020; \r\nРазмер: 70х50.', 'portrait_5_Портрет писателя И.С.Тургенева.jpg', 7800),
(51, 'Портрет А.С.Пушкина', 'Портрет', 'Техника: холст, масло; \r\nГод: 2022; \r\nРазмер: 60х50.', 'portrait_6_Портрет А.С.Пушкина.jpg', 5000);

-- --------------------------------------------------------

--
-- Структура таблицы `orders`
--

CREATE TABLE `orders` (
  `order_id` int NOT NULL,
  `name` varchar(20) COLLATE utf8mb4_general_ci NOT NULL,
  `phone` varchar(30) COLLATE utf8mb4_general_ci NOT NULL,
  `order_sum` int NOT NULL,
  `state` varchar(20) COLLATE utf8mb4_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `orders`
--

INSERT INTO `orders` (`order_id`, `name`, `phone`, `order_sum`, `state`) VALUES
(1, 'Олег', '444444444', 18200, 'оформлен'),
(4, 'Максим', '7778899', 14500, 'оформлен'),
(5, 'Максим', '7778899', 9000, 'оформлен');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `uid` int NOT NULL,
  `ulogin` varchar(15) COLLATE utf8mb4_general_ci NOT NULL,
  `upass` varchar(10) COLLATE utf8mb4_general_ci NOT NULL,
  `uphone` varchar(30) COLLATE utf8mb4_general_ci NOT NULL,
  `uname` varchar(20) COLLATE utf8mb4_general_ci NOT NULL,
  `ulastname` varchar(30) COLLATE utf8mb4_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`uid`, `ulogin`, `upass`, `uphone`, `uname`, `ulastname`) VALUES
(1, 'ivanp', 'ivanp', '7554411', 'Иван', 'Петров'),
(5, 'oleg', 'oleg', '444444444', 'Олег', 'Олегов'),
(6, 'maxim', 'maxim', '7778899', 'Максим', 'Максимов');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `cart`
--
ALTER TABLE `cart`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `goods`
--
ALTER TABLE `goods`
  ADD PRIMARY KEY (`good_id`);

--
-- Индексы таблицы `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`order_id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`uid`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `cart`
--
ALTER TABLE `cart`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;

--
-- AUTO_INCREMENT для таблицы `goods`
--
ALTER TABLE `goods`
  MODIFY `good_id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=52;

--
-- AUTO_INCREMENT для таблицы `orders`
--
ALTER TABLE `orders`
  MODIFY `order_id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `uid` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
